Revit 2026 API

# MEPSupportUtils Class

---

General utility methods for the Autodesk Revit MEP Supporting components.

SystemObject Autodesk.Revit.DBMEPSupportUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class MEPSupportUtils
```
```vb
Public NotInheritable Class MEPSupportUtils
```
```cpp
public ref class MEPSupportUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type MEPSupportUtils = class end
```

The MEPSupportUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateDuctworkStiffener | Create family based stiffener on the specified fabrication ductwork. |

#### Reference

Autodesk.Revit.DB Namespace